classification=[
    "ヒネリ",  #正直何に分類されるのかわからない、考え方次第で誰でも解ける問題？
    "キュー",  #0
    "貪欲法",
    "動的計画法",
    "スタック",
    "二分探索",
    "フィボナッチ数列",
    "ユークリッドの互除法",
    "辞書(Map)",
    "行列",
    "numpy",
    "再帰",
    "転倒数",
    "置換",
    "深さ優先探索",
    "グラフ理論",
    "数学",
    "点と直線の距離",
    "数え上げ",
    "Union-Find木",
    "組み合わせ",
    "繰り返し二乗法",
    "XOR",
    "木",
    "二分法",
    "ダイクストラ法",
    "最短路探索",
    "ナップザック問題",
    "幅優先探索",
    "しゃくとり法",
    "素因数分解",
    "全探索"
    ]

isclear=[
    "他答写し",         #他の人の答えを参考にしてやったが、原理がわからないまま
    "解説見た",         #独力では回答不可能
    "解けてない",        #まだできてない
    "ノーヒントクリア"    #解説見ずにできた
    ]

other=[
    "難しく考えすぎ"       #解説見たら解法あっけなかった時,
    "Pythonだと時間オーバー",
    "Javaだと時間内クリア"
    ]

question={}

#Atcoder
question["ABC-012-D"]=["緑問","解説見た","グラフ理論","ワーシャル・フロイド法","ダイクストラ法","Pythonだと時間オーバー","Javaだと時間内クリア"]
question["ABC-039-D"]=["緑問","ノーヒントクリア","全探索"]
question["ABC-054-C"]=["水問","解説見た","グラフ理論","深さ優先探索"]
question["ABC-070-D"]=["緑問","解説見た","グラフ理論","木","深さ優先探索"]
question["ABC-089-D"]=["水問","解説見た","累積和","ヒネリ","難しく考えすぎ"]
question["ABC-109-D"]=["緑問","ノーヒントクリア","全探索"]
question["ABC-115-D"]=["緑問","解説見た","再帰"]
question["ABC-124-D"]=["緑問","解説見た","しゃくとり法"]
question["ABC-129-D"]=["緑問","解説見た","行列","numpy"]
question["ABC-132-D"]=["緑問","解説見た","組み合わせ"]
question["ABC-140-D"]=["緑問","解説見た","ヒネリ"]
question["ABC-146-D"]=["緑問","他答写し","グラフ理論","木","幅優先探索"]
question["ABC-147-C"]=["緑問","ノーヒントクリア","全探索"]
question["ABC-147-D"]=["緑問","解けてない","数学","XOR"]
question["ABC-148-F"]=["水問","解説見た","木","グラフ理論","深さ優先探索","幅優先探索"]
question["ABC-156-D"]=["緑問","解けてない","組み合わせ","繰り返し二乗法"]
question["ABC-157-D"]=["緑問","解説見た","グラフ理論","Union-Find木"]
question["ABC-159-E"]=["緑問","解けてない","全探索","行列","numpy?","難しく考えすぎ"]
question["ABC-161-D"]=["緑問","解説見た","キュー"]
question["ABC-161-E"]=["緑問","解説見た","貪欲法"]
question["ABC-162-D"]=["緑問","解説見た","全探索"]
question["ABC-165-D"]=["茶問","解説見た","ヒネリ"]
question["ABC-166-E"]=["緑問","解説見た","置換"]
question["ABC-170-D"]=["緑問","解説見た","数学"]
question["ARC-002-C"]=["緑問","解説見た","動的計画法"]
question["ARC-009-B"]=["緑問","解説見た","ヒネリ"]
question["ARC-010-B"]=["緑問","ノーヒントクリア","全探索"]
question["ARC-011-B"]=["緑問","ノーヒントクリア","辞書(Map)"]
question["ARC-011-C"]=["水問","ノーヒントクリア","グラフ理論","ダイクストラ法","最短路探索"]
question["ARC-017-B"]=["緑問","ノーヒントクリア","ヒネリ"]
question["ARC-023-B"]=["緑問","ノーヒントクリア","全探索"]
question["ARC-027-B"]=["水問","解説見た","Union-Find木"]
question["ARC-032-B"]=["緑問","解説見た","グラフ理論","Union-Find木"]
question["ARC-034-B"]=["緑問","解説見た","全探索"]
question["ARC-035-B"]=["緑問","ノーヒントクリア","累積和"]
question["ARC-036-B"]=["緑問","ノーヒントクリア","ヒネリ"]
question["ARC-037-B"]=["緑問","解説見た","グラフ理論","深さ優先探索"]
question["ARC-040-B"]=["緑問","ノーヒントクリア","ヒネリ"]
question["ARC-041-B"]=["緑問","解説見た","全探索"]
question["ARC-042-B"]=["緑問","解説見た","数学","点と直線の距離"]
question["ARC-051-B"]=["緑問","解説見た","フィボナッチ数列","ユークリッドの互除法"]
question["ARC-062-D"]=["水問","解説見た","ヒネリ"]
question["ARC-073-D"]=["水問","解説見た","ナップザック問題","貪欲法"]
question["ARC-074-C"]=["水問","解説見た","ヒネリ"]
question["ARC-081-D"]=["緑問","ノーヒントクリア","数え上げ"]
question["ARC-091-D"]=["緑問","ノーヒントクリア","ヒネリ","数学"]
question["AGC-003-B"]=["緑問","ノーヒントクリア","ヒネリ"]
question["AGC-014-B"]=["緑問","ノーヒントクリア","グラフ理論","木"]
question["AGC-029-A"]=["緑問","ノーヒントクリア","ヒネリ"]
question["AGC-034-B"]=["緑問","解説見た","転倒数","置換"]
question["AGC-038-A"]=["緑問","解説見た","ヒネリ"]
question["AGC-043-A"]=["緑問","解説見た","全探索","動的計画法"]
question["Atcoder Petrozavodsk Contest-001-B"]=["緑問","解説見た","ヒネリ"]
question["Atcoder Petrozavodsk Contest-001-C"]=["緑問","解説見た","二分法"]
question["CADDi2018-C"]=["茶問","解説見た","素因数分解"]
question["CODE FESTIVAL 2014 決勝-C"]=["緑問","ノーヒントクリア","ヒネリ"]
question["CODE FESTIVAL 2015 予選-B"]=["緑問","ノーヒントクリア","ヒネリ"]
question["CODE FESTIVAL 2015 あさぷろ Middle-A"]=["緑問","解説見た","ヒネリ"]
question["CODE FESTIVAL 2017 予選A-B"]=["茶問","解説見た","ヒネリ"]
question["DigitalArts2012-A"]=["緑問","ノーヒントクリア","正規表現"]
question["Indeedなう(予選A)-C"]=["緑問","解説見た","ヒネリ","難しく考えすぎ"]
question["天下一プログラマーコンテスト2012 予選C-B"]=["緑問","ノーヒントクリア","ヒネリ"]
question["天下一プログラマーコンテスト2015 予選B-B"]=["水問","ノーヒントクリア","ヒネリ","字句解析"]
question["全国統一プログラミング王決定戦予選-C"]=["緑問","解説見た","置換","ヒネリ"]
question["パナソニックプログラミングコンテスト 2020-C"]=["茶問","解説見た","数学","ヒネリ"]
question["パナソニックプログラミングコンテスト 2020-D"]=["緑問","ノーヒントクリア","深さ優先探索","キュー"]
question["三井住友信託銀行プログラミングコンテスト2019-E"]=["緑問","解説見た","ヒネリ"]
question["MUJINプログラミングチャレンジ-B"]=["茶問","解説見た","数学"]

question["ABC-174-C"]=["緑問","数学、オイラーの定理、合同式、あまり"]
question["ARC-112-B"]=["緑問","数え上げ、場合の数"]
question["ABC-174-C"]=["緑問"]
question["ABC-172-C"]=["緑問"]
question["ABC-188-D"]=["緑問"]
question["ABC-172-D"]=["緑問","いもす法の工夫、座標圧縮、高速ゼータ変換"]
question["ABC-114-B"]=["緑問"]
question["ABC-185-F"]=["緑問","XOR,セグメント木"]
question["ABC-178-E"]=["緑問","マンハッタン距離"]
question["ABC-177-E"]=["緑問","高速素因数分解、最大公約数"]
question["ABC-191-C"]=["緑問"]
question["ABC-194-D"]=["緑問","確率","期待値","<br>これは正直知らないと一生迷う問題。「有効なのが来るまでカードを引く期待値は、有効なカードを引く確率の逆数になる。」<br>これを知っているかどうか。"]
question["ABC-182-E"]=["緑問"]
question["ARC-110-C"]=["緑問","単純だが実装力の問題"]
question["ABC-192-E"]=["緑問","ダイクストラ法(合ってるはずなのに・・)"]
question["ABC-165-C"]=["緑問"]
question["ARC-111-A"]=["緑問"]
question["AGC-033-A"]=["緑問","幅優先探索"]
question["ABC-188-E"]=["緑問","有向グラフ","動的計画法"]
question["ABC-181-E"]=["緑問","ヒネリ","累積和"]
question["CODE FESTIVAL 2017 予選A-C"]=["水問","ノーヒントクリア","ヒネリ"]
question["ABC-176-E"]=["水問","解説見た","ヒネリ","全探索"]
question["ABC-147-D"]=["水問","解けてない","XOR","ヒネリ"]
question["ARC-107-C"]=["水問","解けてない","行列","ヒネリ"]
question["ARC-106-C"]=["水問","解けてない","行列","ヒネリ"]
question["SoundHoundプログラミングコンテスト-C"]=["水問","解説見た","数学","確率","期待値"]


question["ABC-196-D"]=["全探索","深さ優先探索"]
question["ABC-196-E"]=["関数","合成関数"]

#AOJ
question["AOJ-ALDS-1-3-D"]=["解説見た","スタック"]
question["AOJ-ALDS-1-4-D"]=["解説見た","二分探索"]

for v in question.values():
    pass

