classification=[
    "ヒネリ",  #正直何に分類されるのかわからない、考え方次第で誰でも解ける問題？
    "キュー",  #0
    "貪欲法",
    "動的計画法",
    "スタック",
    "二分探索",
    "フィボナッチ数列",
    "ユークリッドの互除法",
    "辞書(Map)",
    "行列",
    "numpy",
    "再帰",
    "転倒数",
    "置換",
    "深さ優先探索",
    "グラフ理論",
    "数学",
    "点と直線の距離",
    "数え上げ",
    "Union-Find木",
    "組み合わせ",
    "繰り返し二乗法",
    "XOR",
    "木",
    "全探索"
    ]

isclear=[
    "解説見た",         #独力では回答不可能
    "解けてない",        #まだできてない
    "ノーヒントクリア"    #解説見ずにできた
    ]

other=[
    "難しく考えすぎ"       #解説見たら解法あっけなかった時,
    "Pythonだと時間オーバー",
    "Javaだと時間内クリア"
    ]

question={}

#Atcoder
question["ABC-012-D"]=["緑問","解説見た","グラフ理論","ワーシャル・フロイド法","ダイクストラ法","Pythonだと時間オーバー","Javaだと時間内クリア"]
question["ABC-039-D"]=["緑問","ノーヒントクリア","全探索"]
question["ABC-070-D"]=["緑問","解説見た","グラフ理論","木","深さ優先探索"]
question["ABC-109-D"]=["緑問","ノーヒントクリア","全探索"]
question["ABC-115-D"]=["緑問","解説見た","再帰"]
question["ABC-129-D"]=["緑問","解説見た","行列","numpy"]
question["ABC-132-D"]=["緑問","解説見た","組み合わせ"]
question["ABC-140-D"]=["緑問","解説見た","ヒネリ"]
question["ABC-146-D"]=["緑問","解けてない","グラフ理論","深さ優先探索"]
question["ABC-147-C"]=["緑問","ノーヒントクリア","全探索"]
question["ABC-147-D"]=["緑問","解けてない","数学","XOR"]
question["ABC-156-D"]=["緑問","解けてない","組み合わせ","繰り返し二乗法"]
question["ABC-157-D"]=["緑問","解説見た","グラフ理論","Union-Find木"]
question["ABC-159-E"]=["緑問","解けてない","全探索","行列","numpy?","難しく考えすぎ"]
question["ABC-161-D"]=["緑問","解説見た","キュー"]
question["ABC-161-E"]=["緑問","解説見た","貪欲法"]
question["ABC-162-D"]=["緑問","解説見た","全探索"]
question["ABC-166-E"]=["緑問","解けてない","置換"]
question["ARC-002-C"]=["緑問","解説見た","動的計画法"]
question["ARC-009-B"]=["緑問","解説見た","ヒネリ"]
question["ARC-010-B"]=["緑問","ノーヒントクリア","全探索"]
question["ARC-011-B"]=["緑問","ノーヒントクリア","辞書(Map)"]
question["ARC-017-B"]=["緑問","ノーヒントクリア","ヒネリ"]
question["ARC-023-B"]=["緑問","ノーヒントクリア","全探索"]
question["ARC-032-B"]=["緑問","解説見た","グラフ理論","Union-Find木"]
question["ARC-034-B"]=["緑問","解説見た","全探索"]
question["ARC-035-B"]=["緑問","ノーヒントクリア","累積和"]
question["ARC-036-B"]=["緑問","ノーヒントクリア","ヒネリ"]
question["ARC-037-B"]=["緑問","解説見た","グラフ理論","深さ優先探索"]
question["ARC-040-B"]=["緑問","ノーヒントクリア","ヒネリ"]
question["ARC-041-B"]=["緑問","解説見た","全探索"]
question["ARC-042-B"]=["緑問","解説見た","数学","点と直線の距離"]
question["ARC-051-B"]=["緑問","解説見た","フィボナッチ数列","ユークリッドの互除法"]
question["ARC-081-D"]=["緑問","ノーヒントクリア","数え上げ"]
question["ARC-091-D"]=["緑問","ノーヒントクリア","ヒネリ","数学"]
question["AGC-003-B"]=["緑問","ノーヒントクリア","ヒネリ"]
question["AGC-014-B"]=["緑問","解けてない","グラフ理論"]
question["AGC-029-A"]=["緑問","ノーヒントクリア","ヒネリ"]
question["AGC-034-B"]=["緑問","解説見た","転倒数","置換"]
question["AGC-043-A"]=["緑問","解説見た","全探索","動的計画法"]
question["Atcoder Petrozavodsk Contest-001-B"]=["緑問","解説見た","ヒネリ"]
question["CODE FESTIVAL 2014 決勝-C"]=["緑問","ノーヒントクリア","ヒネリ"]
question["CODE FESTIVAL 2015 予選-B"]=["緑問","ノーヒントクリア","ヒネリ"]
question["CODE FESTIVAL 2015 あさぷろ Middle-A"]=["緑問","解説見た","ヒネリ"]
question["DigitalArts2012-A"]=["緑問","ノーヒントクリア","正規表現"]
question["Indeedなう(予選A)-C"]=["緑問","解説見た","ヒネリ","難しく考えすぎ"]
question["天下一プログラマーコンテスト2012 予選C-B"]=["緑問","ノーヒントクリア","ヒネリ"]
question["天下一プログラマーコンテスト2015 予選B-B"]=["水問","ノーヒントクリア","ヒネリ","字句解析"]
question["全国統一プログラミング王決定戦予選-C"]=["緑問","解けてない","ヒネリ"]
question["パナソニックプログラミングコンテスト 2020-D"]=["緑問","ノーヒントクリア","深さ優先探索","キュー"]
question["三井住友信託銀行プログラミングコンテスト2019-E"]=["緑問","解説見た","ヒネリ"]


#AOJ
question["AOJ-ALDS-1-3-D"]=["解説見た","スタック"]
question["AOJ-ALDS-1-4-D"]=["解説見た","二分探索"]

for v in question.values():
    pass

